astral-sh.ty
charliermarsh.ruff
davidanson.vscode-markdownlint
docker.docker
eamodio.gitlens
eliverlara.sweet-vscode-icons
fill-labs.dependi
github.copilot
github.copilot-chat
grapecity.gc-excelviewer
gruntfuggly.todo-tree
hediet.vscode-drawio
james-yu.latex-workshop
jebbs.plantuml
jsynowiec.vscode-insertdatestring
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-python.autopep8
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
mushan.vscode-paste-image
njpwerner.autodocstring
redhat.java
rust-lang.rust-analyzer
shd101wyy.markdown-preview-enhanced
tamasfe.even-better-toml
tomoki1207.pdf
vscjava.migrate-java-to-azure
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
yzhang.markdown-all-in-one
